EDTMKERPNEW.Разработка/src/Documents/ПередачаТоваровХранителю/ПередачаТоваровХранителю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c7c0ead6-40db-47cd-85f3-e065d7c82f48">
  <name>ПередачаТоваровХранителю</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6f74f153-4769-4d47-85fb-0c8b236b71af">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c4a9191-1a55-438f-8d8a-7521137a6d6d">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c34ac0af-a5e9-4320-82f6-f9b31b4c6793">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fec988c-b6d7-4822-bc8a-2bcebc98bbd8">
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6eead0a5-6f6a-46bf-8844-8f1944b7dcaa">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25f3a135-7820-41db-831f-d6e6d987a2a4">
    <name>ПередачаПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63676004-c694-4546-b2aa-2a233b3835f5">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7010dedc-b312-4320-b4c9-8fbb473d8133">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c2b0695-e6b1-48d9-ac97-7d5270873495">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a55bdb4e-bf3e-42df-a984-188dda0c6837">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1968918-6d39-439f-b406-cc078a0e06a4">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2e3b9d8-996f-4aeb-8c14-cb028360a4b4">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b72e7b9-e43a-47fc-afc9-6057cb5e53ec">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="160761db-7fd5-4f46-bfaf-f90ae8c96612">
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="18079968-cc7a-4f94-b893-8cf82c4e84f8">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01c008fb-22b7-4df6-8c5a-d26fcd900849">
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ce3e66f8-84c6-4c6d-a897-f6d1b411fdff">
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1491c559-7b0e-40df-a435-ef8bbbbd2b18">
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8edcaba-a6ca-47fa-9894-519aa0334baf">
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ac84b74-ce74-462b-9016-98a692b286e4">
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e31c60c9-d36f-40db-b4d0-0f86ec42404f">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f7ba1df-7c8f-46ae-90ed-f3b4252f6efa">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5b44517f-9fe5-40cb-9873-833ea12af645">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3de587c1-57bb-4e54-8172-4870f47f27c0">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f46bf728-9471-436e-ba84-fb4accba4b14">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f83cad-3214-4818-ba4a-cf01d7b1e5f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64dc800f-b69f-42f2-a858-b8df407b539f">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aec5ec47-cebe-436f-a5df-624f48d700df">
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b082df29-01c7-48b3-addb-db610bbaeec3">
    <name>ДатаВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="cf556c65-fe1f-4ae9-a843-17287f8a810d">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="42867ac0-e514-44f3-acb1-f5a57ebd05a3">
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b3710b13-71c3-4c86-b21a-aee94bfa573a">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a033e5d3-406a-47e3-a1b3-76c68c32ebaa">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="82944117-5944-46ad-b45c-4a787f7db675">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1571eb11-b228-4191-bae3-6369a96f1eae">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bda6c76b-c2c2-4841-83ca-1ef894aaace0">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4589ac9c-2e35-4bdf-a37c-44355cdd17ee">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0dc27a0e-120c-41ad-9f86-b022a6468e98">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="53f5d55e-fbb4-47c8-a767-064960e22e35">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="74ea739b-f67c-4ad0-b1f3-014384ac4532">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2569045d-51ee-4357-a23f-a5f404c75325">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cad05a06-cd33-4cc7-8ec7-8822f4489535">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="86168fd9-ac0b-41b0-8bad-588df1098e10">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9673ab19-498a-413a-a8ae-e063d277fbad">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fe3ce907-bdab-443a-a451-939ce5cfea67">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b42f938b-a75d-420e-91cd-6012d0d04ebe">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e4d02c34-e005-4187-9e10-5f85e61c2e42">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5e44032e-b664-4277-98b2-3500c4b1c25e">
      <name>СтатусУказанияСерийНаСкладах</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e50e1f98-68d4-4992-8b71-3ab1c8f21217">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b606ab50-37ce-4a3d-add5-14c13fac8574">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e432ec7f-0340-42b8-bc1b-2e4338753167">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разр_Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="276f2301-4595-4f03-9f7b-72ef1ec90f16">
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9a2a4466-e298-4499-9b99-166649dbed06">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f9049da2-b05b-44da-a0e2-323c4bb438ff">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eacbc416-9d77-47b2-a942-938edcc65cb0">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbf42fc3-37da-496e-a65e-0c569af7279b">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3fc4921-ccfe-45a5-800b-e4ca7d801b77">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="efca583d-7f78-47bc-9308-25a6fbf9992a">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="50dbede1-0412-4840-beef-6d8c9c647cfc">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDTMKERPNEW.Разработка/src/Documents/ПередачаТоваровХранителю/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Разр_ДобавитьПоШтрихкодуВместо(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяСобытияОповещения", "ЯрлыкКоробаСчитанПередачаСырья");
	ПараметрыФормы.Вставить("ТекстПодсказки", "Сканируйте штрихкод ярлыка короба.");

	ОткрытьФорму(
		"ОбщаяФорма.Разр_ВводШтрихкодаОдиночный",
		ПараметрыФормы,
		ЭтаФорма
	);

КонецПроцедуры

&НаКлиенте
Процедура Разр_ДобавитьПоШтрихкодамВместо(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяСобытияОповещения", "ЯрлыкиКоробаСчитаныПередачаСырья");
	ПараметрыФормы.Вставить("ТекстПодсказки", "Укажите количество и сканируйте штрихкоды ярлыков коробов.");

	ОткрытьФорму(
		"ОбщаяФорма.Разр_ВводШтрихкодаМассовый",
		ПараметрыФормы,
		ЭтаФорма
	);

КонецПроцедуры

&НаКлиенте
Функция Разр_ПодготовитьДанныеЯрлыкаКПередаче(ДанныеЯрлыка)

	Если ДанныеЯрлыка = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Характеристика = Неопределено;

	Если Не ДанныеЯрлыка.Свойство("Характеристика", Характеристика) Тогда
		Возврат Истина;
	КонецЕсли;

	ХарактеристикаСтерильно =
		Разр_ЗаполнениеТЧПоЯрлыкамСервер.ПолучитьХарактеристикуСтерильно();

	Если Не ЗначениеЗаполнено(ХарактеристикаСтерильно)
		Или Характеристика <> ХарактеристикаСтерильно Тогда
		Возврат Истина;
	КонецЕсли;

	ХарактеристикаНаСтерилизацию =
		Разр_ЗаполнениеТЧПоЯрлыкамСервер.ПолучитьХарактеристикуНаСтерилизацию();

	Если Не ЗначениеЗаполнено(ХарактеристикаНаСтерилизацию) Тогда
		ПоказатьПредупреждение(, "Не найдена характеристика ""На стерилизацию"".");
		Возврат Ложь;
	КонецЕсли;

	ДанныеЯрлыка.Характеристика = ХарактеристикаНаСтерилизацию;
	//ДанныеЯрлыка.Назначение = Неопределено;

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура Разр_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)

	Настройки = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.НастройкиПоУмолчанию();

	// Здесь можно переопределить имена ТЧ для конкретного документа
	Настройки.ИмяТЧНоменклатуры = "Товары";
	Настройки.ИмяТЧШтрихкодов = "Разр_Штрихкоды";
	Настройки.ИмяТЧСерий = "Серии";
	Настройки.ИмяСобытияОповещения = ИмяСобытия;
	
	Настройки.ПоляИзЯрлыкаВСтроку.Добавить("ЗаказКлиента");
	// Строки с разными спецификациями не должны объединяться.
	Настройки.КлючевыеПоляСтрок.Добавить("ЗаказКлиента");
	//Настройки.КлючевыеПоляСтрок.Добавить("Назначение");
	
	Если ИмяСобытия = "ЯрлыкКоробаСчитанПередачаСырья" Тогда
		
		Если Не Разр_ПодготовитьДанныеЯрлыкаКПередаче(Параметр) Тогда
			Возврат;
		КонецЕсли;

		Результат = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.ДобавитьНоменклатуруПоЯрлыку(
			Объект,
			Параметр,
			Настройки
		);

		Если Результат.Изменено Тогда
			Модифицированность = Истина;
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "ЯрлыкиКоробаСчитаныПередачаСырья" Тогда

		Если Параметр = Неопределено 
			Или Не Параметр.Свойство("Ярлыки") Тогда

			ПоказатьПредупреждение(, "Не получены данные массового сканирования.");
			Возврат;

		КонецЕсли;
		
		Для Каждого ДанныеЯрлыка Из Параметр.Ярлыки Цикл

			Если Не Разр_ПодготовитьДанныеЯрлыкаКПередаче(ДанныеЯрлыка) Тогда
				Возврат;
			КонецЕсли;

		КонецЦикла;
		
		Результат = Разр_ЗаполнениеТЧПоЯрлыкамКлиент.ДобавитьНоменклатурыПоЯрлыкам(
			Объект,
			Параметр.Ярлыки,
			Настройки
		);

		Если Результат.Изменено Тогда
			Модифицированность = Истина;
		КонецЕсли;

	КонецЕсли;
    ОбновитьДоступностьТЧ_ТОвары();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьТЧ_ТОвары()
    Элементы.Товары.ТолькоПросмотр = Объект.Разр_Штрихкоды.Количество() > 0;
КонецПроцедуры // ОбновитьДоступностьТЧ_ТОвары()

&НаКлиенте
Процедура Разр_ПриОткрытииПосле(Отказ)
	ОбновитьДоступностьТЧ_ТОвары();
КонецПроцедуры

&НаКлиенте
Процедура Разр_Разр_ШтрихкодыПриИзмененииВместо(Элемент)
	ОбновитьДоступностьТЧ_ТОвары();
КонецПроцедуры

&НаКлиенте
Процедура Разр_ОчиститьТабличныеЧастиВместо(Команда)
	Оповещение = Новый ОписаниеОповещения(
		"ПослеВопросаОчиститьЗаполнениеПоШтрихкодам",
		ЭтаФорма
	);

	ПоказатьВопрос(
		Оповещение,
		"Очистить штрихкоды и товары, заполненные по штрихкодам?",
		РежимДиалогаВопрос.ДаНет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОчиститьЗаполнениеПоШтрихкодам(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Объект.Разр_Штрихкоды.Очистить();
	Объект.Товары.Очистить();
	Объект.Серии.Очистить();

	Модифицированность = Истина;
	
	ОбновитьДоступностьТЧ_ТОвары();

КонецПроцедуры



//&НаКлиенте
//Процедура Разр_Разр_ДобавитьПоШтрихкодуВместо(Команда)
//	ПараметрыФормы = Новый Структура;

//	ПараметрыФормы.Вставить(
//		"ИмяСобытияОповещения",
//		"Разр_ЯрлыкКоробаСчитанПередачаСырья"
//	);

//	ПараметрыФормы.Вставить(
//		"ТекстПодсказки",
//		"Сканируйте штрихкод ярлыка короба."
//	);

//	ОткрытьФорму(
//		"ОбщаяФорма.Разр_ВводШтрихкодаОдиночный",
//		ПараметрыФормы,
//		ЭтаФорма
//	);
//КонецПроцедуры

//&НаКлиенте
//Процедура Разр_ДобавитьНоменклатуруВТоварыПоЯрлыку(ДанныеЯрлыка)

//	Если ДанныеЯрлыка = Неопределено Тогда
//		ПоказатьПредупреждение(, "Не получены данные ярлыка.");
//		Возврат;
//	КонецЕсли;

//	Если Не ДанныеЯрлыка.Свойство("Штрихкод") Тогда
//		ПоказатьПредупреждение(, "В данных ярлыка отсутствует штрихкод.");
//		Возврат;
//	КонецЕсли;

//	Штрихкод = СокрЛП(ДанныеЯрлыка.Штрихкод);

//	Если ПустаяСтрока(Штрихкод) Тогда
//		ПоказатьПредупреждение(, "В данных ярлыка пустой штрихкод.");
//		Возврат;
//	КонецЕсли;

//	// Проверяем, не сканировали ли этот ярлык ранее
//	Для Каждого СтрокаШтрихкода Из Объект.Разр_Штрихкоды Цикл
//		
//		Если СокрЛП(СтрокаШтрихкода.Штрихкод) = Штрихкод Тогда
//			ПоказатьПредупреждение(, 
//				"Этот штрихкод уже добавлен в документ." + Символы.ПС
//				+ "Штрихкод: " + Штрихкод);
//			Возврат;
//		КонецЕсли;
//		
//	КонецЦикла;

//	Если Не ДанныеЯрлыка.Свойство("Номенклатура") Тогда
//		ПоказатьПредупреждение(, "В данных ярлыка отсутствует номенклатура.");
//		Возврат;
//	КонецЕсли;

//	Если Не ЗначениеЗаполнено(ДанныеЯрлыка.Номенклатура) Тогда
//		ПоказатьПредупреждение(, "В ярлыке не заполнена номенклатура.");
//		Возврат;
//	КонецЕсли;

//	// Если такого штрихкода ещё нет — добавляем его в ТЧ Разр_Штрихкоды
//	НоваяСтрокаШтрихкода = Объект.Разр_Штрихкоды.Добавить();
//	НоваяСтрокаШтрихкода.Штрихкод = Штрихкод;

//	// Если номенклатура уже есть в ТЧ Товары — увеличиваем количество
//	Для Каждого СтрокаТоваров Из Объект.Товары Цикл

//		Если СтрокаТоваров.Номенклатура = ДанныеЯрлыка.Номенклатура 
//			И СтрокаТоваров.Характеристика = ДанныеЯрлыка.Характеристика
//			И СтрокаТоваров.Упаковка = ДанныеЯрлыка.Упаковка
//			И СтрокаТоваров.Серия = ДанныеЯрлыка.Серия
//			И СтрокаТоваров.Назначение = ДанныеЯрлыка.Назначение
//			Тогда

//			СтрокаТоваров.КоличествоУпаковок = СтрокаТоваров.КоличествоУпаковок + 1;

//			Если ЗначениеЗаполнено(СтрокаТоваров.Упаковка) Тогда
//				СтрокаТоваров.Количество = СтрокаТоваров.КоличествоУпаковок * СтрокаТоваров.Упаковка.Числитель;
//			Иначе
//				СтрокаТоваров.Количество = СтрокаТоваров.КоличествоУпаковок;
//			КонецЕсли;

//			Модифицированность = Истина;

//			Сообщить("Количество увеличено: " + Строка(ДанныеЯрлыка.Номенклатура));
//			Для Каждого СтрокаСерии Из Объект.Серии Цикл				
//				Если СтрокаСерии.Номенклатура = ДанныеЯрлыка.Номенклатура 
//					И СтрокаСерии.Характеристика = ДанныеЯрлыка.Характеристика			
//					И СтрокаСерии.Серия = ДанныеЯрлыка.Серия
//					И СтрокаСерии.Назначение = ДанныеЯрлыка.Назначение
//					Тогда
//					Если ЗначениеЗаполнено(СтрокаТоваров.Упаковка) Тогда
//						СтрокаСерии.Количество = СтрокаТоваров.КоличествоУпаковок * СтрокаТоваров.Упаковка.Числитель;
//					Иначе
//						СтрокаСерии.Количество = СтрокаТоваров.КоличествоУпаковок + 1;
//					КонецЕсли;					
//				КонецЕсли;				
//			КонецЦикла;
//			Возврат;

//		КонецЕсли;

//	КонецЦикла;

//	// Если такой номенклатуры нет — добавляем новую строку
//	НоваяСтрока = Объект.Товары.Добавить();

//	НоваяСтрока.Номенклатура = ДанныеЯрлыка.Номенклатура;
//	НоваяСтрока.Характеристика = ДанныеЯрлыка.Характеристика;
//	НоваяСтрока.Упаковка = ДанныеЯрлыка.Упаковка;
//	НоваяСтрока.КоличествоУпаковок = 1;
//	НоваяСтрока.СтатусУказанияСерий = 2;
//	НоваяСтрока.СтатусУказанияСерийНаСкладах = 2;
//    //НоваяСтрока.АналитикаУчетаНоменклатуры = ДанныеЯрлыка.АналитикаУчетаНоменклатуры;
//	НоваяСтрока.Склад = Объект.Склад;
//	НоваяСтрока.Назначение = ДанныеЯрлыка.Назначение;
//	НоваяСтрока.ЗаказПереработчику = ДанныеЯрлыка.ЭтапПроизводства.ЗаказПереработчику;
//	НоваяСтрока.Серия = ДанныеЯрлыка.Серия;
//	
//	Если ЗначениеЗаполнено(НоваяСтрока.Упаковка) Тогда
//		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * НоваяСтрока.Упаковка.Числитель;
//	Иначе
//		НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
//	КонецЕсли;
//	
//	НоваяСтрокаСерия = Объект.Серии.Добавить();
//	НоваяСтрокаСерия.Номенклатура = ДанныеЯрлыка.Номенклатура;
//	НоваяСтрокаСерия.Серия = ДанныеЯрлыка.Серия;
//	НоваяСтрокаСерия.Характеристика = ДанныеЯрлыка.Характеристика;
//	НоваяСтрокаСерия.Назначение = ДанныеЯрлыка.Назначение;
//	НоваяСтрокаСерия.Склад = Объект.Склад;
//	
//	
//	Если ЗначениеЗаполнено(НоваяСтрока.Упаковка) Тогда
//		НоваяСтрокаСерия.Количество = НоваяСтрока.КоличествоУпаковок * НоваяСтрока.Упаковка.Числитель;
//	Иначе
//		НоваяСтрокаСерия.Количество = НоваяСтрока.КоличествоУпаковок;
//	КонецЕсли;

//	Модифицированность = Истина;

//	Сообщить("Добавлена номенклатура: " + Строка(ДанныеЯрлыка.Номенклатура));

//КонецПроцедуры

//&НаКлиенте
//Процедура Разр_ОбработкаОповещенияПосле1(ИмяСобытия, Параметр, Источник)
//		
//	Если ИмяСобытия = "Разр_ЯрлыкКоробаСчитанПередачаСырья" Тогда

//		Разр_ДобавитьНоменклатуруВТоварыПоЯрлыку(Параметр);

//	ИначеЕсли ИмяСобытия = "НС_ШтрихкодыСчитаныМассово" Тогда

//		Если Параметр = Неопределено 
//			Или Не Параметр.Свойство("Ярлыки") Тогда

//			ПоказатьПредупреждение(, "Не получены данные массового сканирования.");
//			Возврат;

//		КонецЕсли;

//	Разр_ДобавитьНоменклатурыВТоварыПоЯрлыкам(Параметр.Ярлыки);
//	
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура Разр_ДобавитьПоШтрихкодамВместо(Команда)
//	ПараметрыФормы = Новый Структура;

//	ПараметрыФормы.Вставить(
//		"ИмяСобытияОповещения",
//		"НС_ШтрихкодыСчитаныМассово"
//	);

//	ПараметрыФормы.Вставить(
//		"ТекстПодсказки",
//		"Укажите количество и сканируйте штрихкоды ярлыков коробов."
//	);

//	ОткрытьФорму(
//		"ОбщаяФорма.Разр_ВводШтрихкодаМассовый",
//		ПараметрыФормы,
//		ЭтаФорма
//	);
//КонецПроцедуры

//&НаКлиенте
//Процедура Разр_ДобавитьНоменклатурыВТоварыПоЯрлыкам(Ярлыки)

//	Для Каждого ДанныеЯрлыка Из Ярлыки Цикл
//		Разр_ДобавитьНоменклатуруВТоварыПоЯрлыку(ДанныеЯрлыка);
//	КонецЦикла;

//КонецПроцедуры
